src/Documents/Комплектация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Комплектация</Name>
			<BasedOn>
				<xr:Item>Document.Рецепт</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиБлюд</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПродуктов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Блюдо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПорций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рецепт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Рецепт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ингридиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиПродуктов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ИзмененияВРецептах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияВРецептах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Блюда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/Рецепт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Рецепт</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИзмененияВРецептах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Блюдо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ингридиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Комплектация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПроверитьНаличиеИнгридиентовНаСкладеНаСервере(Рецепт)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РецептСостав.Ингридиент КАК Ингридиент,
	|	ОстаткиПродуктовОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	Документ.Рецепт.Состав КАК РецептСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПродуктов.Остатки КАК ОстаткиПродуктовОстатки
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиПродуктовОстатки.Продукт = РецептСостав.Ингридиент
	|	И РецептСостав.Ссылка = &Рецепт
	|
	|СГРУППИРОВАТЬ ПО
	|	РецептСостав.Ингридиент,
	|	ОстаткиПродуктовОстатки.КоличествоОстаток";
	Запрос.УстановитьПараметр("Рецепт",Рецепт);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаИзЗапроса = РезультатЗапроса.Выгрузить();
	Остатки = ТаблицаИзЗапроса.ВыгрузитьКолонку("КоличествоОстаток");
	Ингридиенты = ТаблицаИзЗапроса.ВыгрузитьКолонку("Ингридиент");
	Структура = Новый Структура;
	Структура.Вставить("Ингридиенты",Ингридиенты);
	Структура.Вставить("Остатки",Остатки);
	Возврат Структура;
КонецФункции

&НаКлиенте
Процедура ПроверитьНаличиеИнгридиентовНаСкладе(Команда)
	Структура = ПроверитьНаличиеИнгридиентовНаСкладеНаСервере(Объект.Рецепт);
	Остатки = Структура.Остатки;
	Ингридиенты = Структура.Ингридиенты;
	Состав = Объект.Состав;
	КоличествоНедостающихИнгридиентов = 0;
	ПропущеноИнгридиентов = 0;
	КолвоОстатков = Остатки.Количество();
	Для Счетчик = 0 по Состав.Количество()-1 цикл
		СтрокаТабличнойЧасти = Состав.Получить(Счетчик);
		ПоследнийИндексВОстатках = Остатки.ВГраница();
		Если ПоследнийИндексВОстатках<0 или ПоследнийИндексВОстатках<Счетчик-ПропущеноИнгридиентов тогда
			СтрокаТабличнойЧасти.Количество = 0;
			КоличествоНедостающихИнгридиентов = КоличествоНедостающихИнгридиентов+1;	
		Иначе	
			Если СтрокаТабличнойЧасти.Ингридиент = Ингридиенты[Счетчик-ПропущеноИнгридиентов] тогда
				Количество = СтрокаТабличнойЧасти.Количество;
				Если Строка(СтрокаТабличнойЧасти.ЕдиницыИзмерения) = "Гр." тогда
					Количество = СтрокаТабличнойЧасти.Количество/1000;
				КонецЕсли;
				Если Количество > Остатки[Счетчик-ПропущеноИнгридиентов] тогда
					СтрокаТабличнойЧасти.Количество = 0;
					КоличествоНедостающихИнгридиентов = КоличествоНедостающихИнгридиентов+1;
				КонецЕсли;
			иначе 
				ПропущеноИнгридиентов = ПропущеноИнгридиентов+1;
				СтрокаТабличнойЧасти.Количество = 0;
				КоличествоНедостающихИнгридиентов = КоличествоНедостающихИнгридиентов+1;		
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;   
	Если КоличествоНедостающихИнгридиентов = 0 тогда
		Сообщить("На складе есть все необходимые ингридиенты, можно готовить блюдо.");
	Иначе
		Сообщить("Количество недостающих ингридиентов: "+КоличествоНедостающихИнгридиентов+".  Приготовить блюдо нельзя!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура БлюдоПриИзмененииНаСервере(БлюдоДляПоиска,Период)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РецептСостав.Ингридиент КАК Ингридиент,
	|	РецептСостав.Количество КАК Количество,
	|	РецептСостав.ЕдиницыИзмерения КАК ЕдиницыИзмерения,
	|	Рецепт.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Рецепт.Состав КАК РецептСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рецепт КАК Рецепт
	|			ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.ИзмененияВРецептах.СрезПоследних(&Дата, ) КАК ИзмененияВРецептахСрезПоследних
	|			ПО (ИзмененияВРецептахСрезПоследних.Регистратор = Рецепт.Ссылка)
	|		ПО (РецептСостав.Ссылка = Рецепт.Ссылка)
	|ГДЕ
	|	ИзмененияВРецептахСрезПоследних.Блюда.Ссылка = &Блюдо";
	Запрос.УстановитьПараметр("Блюдо",БлюдоДляПоиска);
	Запрос.УстановитьПараметр("Дата",Период);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаИзЗапроса = РезультатЗапроса.Выгрузить();
	Ссылки = ТаблицаИзЗапроса.ВыгрузитьКолонку("Ссылка");
	Объект.Рецепт = Ссылки[0];
	Объект.Состав.Загрузить(ТаблицаИзЗапроса);
	Объект.КоличествоПорций = РаботаСДокументами.РасчитатьКоличествоПорций(ТаблицаИзЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура БлюдоПриИзменении(Элемент)
	Период = Объект.Дата;
	БлюдоДляПоиска = Объект.Блюдо;
	БлюдоПриИзмененииНаСервере(БлюдоДляПоиска,Период);
	Элементы.ПроверитьНаличиеИнгридиентовНаСкладе.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	БлюдоПриИзменении(Элемент);
КонецПроцедуры
